deneyapkart/deneyapkart-arduino-core/boards.txt
# Deneyap Gelistirme Kartlari
# version=1.3.12

# Official Espressif options
menu.UploadSpeed=Upload Speed
menu.USBMode=USB Mode
menu.CDCOnBoot=USB CDC On Boot
menu.MSCOnBoot=USB Firmware MSC On Boot
menu.DFUOnBoot=USB DFU On Boot
menu.UploadMode=Upload Mode
menu.CPUFreq=CPU Frequency
menu.FlashFreq=Flash Frequency
menu.FlashMode=Flash Mode
menu.FlashSize=Flash Size
menu.PartitionScheme=Partition Scheme
menu.DebugLevel=Core Debug Level
menu.PSRAM=PSRAM
menu.LoopCore=Arduino Runs On
menu.EventsCore=Events Run On
menu.MemoryType=Memory Type
menu.EraseFlash=Erase All Flash Before Sketch Upload
menu.JTAGAdapter=JTAG Adapter

# Custom options
menu.Revision=Board Revision
menu.LORAWAN_REGION=LoRaWan Region
menu.LoRaWanDebugLevel=LoRaWan Debug Level
menu.LORAWAN_DEVEUI=LoRaWan DevEUI
menu.LORAWAN_PREAMBLE_LENGTH=LoRaWan Preamble Length

##############################################################

dydk_mpv10.name=Deneyap Kart

dydk_mpv10.bootloader.tool=esptool_py
dydk_mpv10.bootloader.tool.default=esptool_py

dydk_mpv10.upload.tool=esptool_py
dydk_mpv10.upload.tool.default=esptool_py
dydk_mpv10.upload.tool.network=esp_ota

dydk_mpv10.upload.maximum_size=1310720
dydk_mpv10.upload.maximum_data_size=327680
dydk_mpv10.upload.flags=
dydk_mpv10.upload.extra_flags=

dydk_mpv10.serial.disableDTR=true
dydk_mpv10.serial.disableRTS=true

dydk_mpv10.build.tarch=xtensa
dydk_mpv10.build.bootloader_addr=0x1000
dydk_mpv10.build.target=esp32
dydk_mpv10.build.mcu=esp32
dydk_mpv10.build.core=esp32
dydk_mpv10.build.variant=dydk_mpv10
dydk_mpv10.build.board=DYDK

dydk_mpv10.build.f_cpu=240000000L
dydk_mpv10.build.flash_size=4MB
dydk_mpv10.build.flash_freq=80m
dydk_mpv10.build.flash_mode=dio
dydk_mpv10.build.boot=qio
dydk_mpv10.build.partitions=default
dydk_mpv10.build.defines=
dydk_mpv10.build.loop_core=
dydk_mpv10.build.event_core=

## IDE 2.0 Seems to not update the value
dydk_mpv10.menu.JTAGAdapter.default=Disabled
dydk_mpv10.menu.JTAGAdapter.default.build.copy_jtag_files=0
dydk_mpv10.menu.JTAGAdapter.external=FTDI Adapter
dydk_mpv10.menu.JTAGAdapter.external.build.openocdscript=esp32-wrover-kit-3.3v.cfg
dydk_mpv10.menu.JTAGAdapter.external.build.copy_jtag_files=1
dydk_mpv10.menu.JTAGAdapter.bridge=ESP USB Bridge
dydk_mpv10.menu.JTAGAdapter.bridge.build.openocdscript=esp32-bridge.cfg
dydk_mpv10.menu.JTAGAdapter.bridge.build.copy_jtag_files=1

dydk_mpv10.menu.PSRAM.enabled=Enabled
dydk_mpv10.menu.PSRAM.enabled.build.defines=-DBOARD_HAS_PSRAM -mfix-esp32-psram-cache-issue -mfix-esp32-psram-cache-strategy=memw
dydk_mpv10.menu.PSRAM.enabled.build.extra_libs=
dydk_mpv10.menu.PSRAM.disabled=Disabled
dydk_mpv10.menu.PSRAM.disabled.build.defines=
dydk_mpv10.menu.PSRAM.disabled.build.extra_libs=

dydk_mpv10.menu.PartitionScheme.default=Default 4MB with spiffs (1.2MB APP/1.5MB SPIFFS)
dydk_mpv10.menu.PartitionScheme.default.build.partitions=default
dydk_mpv10.menu.PartitionScheme.defaultffat=Default 4MB with ffat (1.2MB APP/1.5MB FATFS)
dydk_mpv10.menu.PartitionScheme.defaultffat.build.partitions=default_ffat
dydk_mpv10.menu.PartitionScheme.default_8MB=8M with spiffs (3MB APP/1.5MB SPIFFS)
dydk_mpv10.menu.PartitionScheme.default_8MB.build.partitions=default_8MB
dydk_mpv10.menu.PartitionScheme.default_8MB.upload.maximum_size=3342336
dydk_mpv10.menu.PartitionScheme.minimal=Minimal (1.3MB APP/700KB SPIFFS)
dydk_mpv10.menu.PartitionScheme.minimal.build.partitions=minimal
dydk_mpv10.menu.PartitionScheme.no_ota=No OTA (2MB APP/2MB SPIFFS)
dydk_mpv10.menu.PartitionScheme.no_ota.build.partitions=no_ota
dydk_mpv10.menu.PartitionScheme.no_ota.upload.maximum_size=2097152
dydk_mpv10.menu.PartitionScheme.noota_3g=No OTA (1MB APP/3MB SPIFFS)
dydk_mpv10.menu.PartitionScheme.noota_3g.build.partitions=noota_3g
dydk_mpv10.menu.PartitionScheme.noota_3g.upload.maximum_size=1048576
dydk_mpv10.menu.PartitionScheme.noota_ffat=No OTA (2MB APP/2MB FATFS)
dydk_mpv10.menu.PartitionScheme.noota_ffat.build.partitions=noota_ffat
dydk_mpv10.menu.PartitionScheme.noota_ffat.upload.maximum_size=2097152
dydk_mpv10.menu.PartitionScheme.noota_3gffat=No OTA (1MB APP/3MB FATFS)
dydk_mpv10.menu.PartitionScheme.noota_3gffat.build.partitions=noota_3gffat
dydk_mpv10.menu.PartitionScheme.noota_3gffat.upload.maximum_size=1048576
dydk_mpv10.menu.PartitionScheme.huge_app=Huge APP (3MB No OTA/1MB SPIFFS)
dydk_mpv10.menu.PartitionScheme.huge_app.build.partitions=huge_app
dydk_mpv10.menu.PartitionScheme.huge_app.upload.maximum_size=3145728
dydk_mpv10.menu.PartitionScheme.min_spiffs=Minimal SPIFFS (1.9MB APP with OTA/190KB SPIFFS)
dydk_mpv10.menu.PartitionScheme.min_spiffs.build.partitions=min_spiffs
dydk_mpv10.menu.PartitionScheme.min_spiffs.upload.maximum_size=1966080
dydk_mpv10.menu.PartitionScheme.fatflash=16M Flash (2MB APP/12.5MB FATFS)
dydk_mpv10.menu.PartitionScheme.fatflash.build.partitions=ffat
dydk_mpv10.menu.PartitionScheme.fatflash.upload.maximum_size=2097152
dydk_mpv10.menu.PartitionScheme.app3M_fat9M_16MB=16M Flash (3MB APP/9.9MB FATFS)
dydk_mpv10.menu.PartitionScheme.app3M_fat9M_16MB.build.partitions=app3M_fat9M_16MB
dydk_mpv10.menu.PartitionScheme.app3M_fat9M_16MB.upload.maximum_size=3145728
dydk_mpv10.menu.PartitionScheme.rainmaker=RainMaker
dydk_mpv10.menu.PartitionScheme.rainmaker.build.partitions=rainmaker
dydk_mpv10.menu.PartitionScheme.rainmaker.upload.maximum_size=3145728

dydk_mpv10.menu.CPUFreq.240=240MHz (WiFi/BT)
dydk_mpv10.menu.CPUFreq.240.build.f_cpu=240000000L
dydk_mpv10.menu.CPUFreq.160=160MHz (WiFi/BT)
dydk_mpv10.menu.CPUFreq.160.build.f_cpu=160000000L
dydk_mpv10.menu.CPUFreq.80=80MHz (WiFi/BT)
dydk_mpv10.menu.CPUFreq.80.build.f_cpu=80000000L
dydk_mpv10.menu.CPUFreq.40=40MHz (40MHz XTAL)
dydk_mpv10.menu.CPUFreq.40.build.f_cpu=40000000L
dydk_mpv10.menu.CPUFreq.26=26MHz (26MHz XTAL)
dydk_mpv10.menu.CPUFreq.26.build.f_cpu=26000000L
dydk_mpv10.menu.CPUFreq.20=20MHz (40MHz XTAL)
dydk_mpv10.menu.CPUFreq.20.build.f_cpu=20000000L
dydk_mpv10.menu.CPUFreq.13=13MHz (26MHz XTAL)
dydk_mpv10.menu.CPUFreq.13.build.f_cpu=13000000L
dydk_mpv10.menu.CPUFreq.10=10MHz (40MHz XTAL)
dydk_mpv10.menu.CPUFreq.10.build.f_cpu=10000000L

dydk_mpv10.menu.FlashMode.qio=QIO
dydk_mpv10.menu.FlashMode.qio.build.flash_mode=dio
dydk_mpv10.menu.FlashMode.qio.build.boot=qio
dydk_mpv10.menu.FlashMode.dio=DIO
dydk_mpv10.menu.FlashMode.dio.build.flash_mode=dio
dydk_mpv10.menu.FlashMode.dio.build.boot=dio
dydk_mpv10.menu.FlashMode.qout=QOUT
dydk_mpv10.menu.FlashMode.qout.build.flash_mode=dout
dydk_mpv10.menu.FlashMode.qout.build.boot=qout
dydk_mpv10.menu.FlashMode.dout=DOUT
dydk_mpv10.menu.FlashMode.dout.build.flash_mode=dout
dydk_mpv10.menu.FlashMode.dout.build.boot=dout

dydk_mpv10.menu.FlashFreq.80=80MHz
dydk_mpv10.menu.FlashFreq.80.build.flash_freq=80m
dydk_mpv10.menu.FlashFreq.40=40MHz
dydk_mpv10.menu.FlashFreq.40.build.flash_freq=40m

dydk_mpv10.menu.UploadMode.Auto=Auto
dydk_mpv10.menu.UploadMode.Auto.upload.mode=default_reset
dydk_mpv10.menu.UploadMode.Manual=Manual
dydk_mpv10.menu.UploadMode.Manual.upload.mode=no_reset

dydk_mpv10.menu.FlashSize.4M=4MB (32Mb)
dydk_mpv10.menu.FlashSize.4M.build.flash_size=4MB
dydk_mpv10.menu.FlashSize.8M=8MB (64Mb)
dydk_mpv10.menu.FlashSize.8M.build.flash_size=8MB
dydk_mpv10.menu.FlashSize.8M.build.partitions=default_8MB
dydk_mpv10.menu.FlashSize.2M=2MB (16Mb)
dydk_mpv10.menu.FlashSize.2M.build.flash_size=2MB
dydk_mpv10.menu.FlashSize.2M.build.partitions=minimal
dydk_mpv10.menu.FlashSize.16M=16MB (128Mb)
dydk_mpv10.menu.FlashSize.16M.build.flash_size=16MB

